PlvLuin-243/STM32-Peripheral-Libraries/CAN_MASTER/main.c
#include "stm32f10x.h"
#include "gpio.h"
#include "can.h"
#include "systick.h"
#include "timer.h"
#include "lcd.h"
#include "adc.h"
#include <stdio.h>
#include <stdbool.h>

// =================== ENUMS ===================
typedef enum {
    MODE_SETPOINT_UART = 0,
    MODE_SETPOINT_ADC,
} master_mode_t;

typedef enum {
    CONTROL_TARGET_SLAVE1 = 0,
    CONTROL_TARGET_SLAVE2,
    CONTROL_TARGET_ALL,
} control_target_t;
typedef enum {
    STATUS_IDLE = 0x00,
    STATUS_RUNNING = 0x01,
    STATUS_STOPPED = 0x02,
    STATUS_ERROR = 0xFF
} slave_status_t;

// =================== DEFINES ===================
#define BUTTON_MODE_PORT        GPIOB
#define BUTTON_MODE_PIN         GPIO_PIN_11
#define BUTTON_SLAVE1_PORT      GPIOB
#define BUTTON_SLAVE1_PIN       GPIO_PIN_10
#define BUTTON_SLAVE2_PORT      GPIOB
#define BUTTON_SLAVE2_PIN       GPIO_PIN_1
#define BUTTON_CONTROL_PORT     GPIOB
#define BUTTON_CONTROL_PIN      GPIO_PIN_0

#define DEBOUNCE_DELAY_MS       10
#define LCD_UPDATE_PERIOD_MS    100
#define CONNECTION_TIMEOUT_MS   5000

// ADC and conversion constants
#define ADC_MAX_VALUE           4090
#define PERCENTAGE_MAX          100

// SLAVE1 (Motor) constants
#define MOTOR_MAX_RPM           6200

// SLAVE2 (Buck) constants
#define BUCK_MAX_VOLT           1000    // 10.00V in 0.01V units

// Status Register (SR) bit definitions
#define SR_BTN_SLAVE1           (1 << 0)   // Bit 0: Button Slave1 pressed
#define SR_BTN_SLAVE2           (1 << 1)   // Bit 1: Button Slave2 pressed
#define SR_BTN_MODE             (1 << 2)   // Bit 2: Button Mode pressed
#define SR_BTN_CONTROL          (1 << 3)   // Bit 3: Button Control pressed
#define SR_LCD_UPDATE           (1 << 4)   // Bit 4: LCD update flag
#define SR_ADC_UPDATE           (1 << 5)   // Bit 5: ADC update flag
#define SR_TIMER_100MS          (1 << 6)   // Bit 6: Timer 100ms flag
#define SR_CAN_RX               (1 << 7)   // Bit 7: CAN message received
#define SR_STATUS_CHECK         (1 << 8)   // Bit 8: Status check flag (every 3s)
#define SR_SETPOINT_UPDATE      (1 << 9)   // Bit 9: Setpoint update flag (every 100ms)

// =================== STRUCTS ===================
typedef struct {
    GPIO_TypeDef *port;
    uint16_t pin;
} button_t;

typedef struct {
    uint8_t status;
    uint16_t current_setpoint;
} slave_info_t;

typedef struct {
    master_mode_t current_mode;
    control_target_t control_target;
    uint8_t uart_setpoint;
    uint16_t adc_value;
    uint8_t adc_setpoint;
} master_control_t;

// =================== GLOBAL VARIABLES ===================
// Status Register - Contains all system flags
volatile uint16_t SR = 0x0000;

// Timer variables
volatile uint16_t lcd_update_counter = 0;
volatile uint16_t status_check_counter = 0;

// Control structures
master_control_t master_ctrl;
button_t button_mode;
button_t button_slave1;
button_t button_slave2;
button_t button_control;
slave_info_t slave1_info;
slave_info_t slave2_info;

// =================== FUNCTION DECLARATIONS ===================
// System initialization
void system_init(void);
void buttons_init(void);
void variables_init(void);
void adc_gpio_init(void);
void adc_process(void);

// Button handling
void button_init(button_t *btn, GPIO_TypeDef *port, uint16_t pin);
uint8_t button_debounce(button_t *btn);
void button_process_all(void);
void button_mode_handler(void);
void button_slave1_handler(void);
void button_slave2_handler(void);
void button_control_handler(void);

// CAN communication
void can_send_command(can_command_t cmd);
void can_send_setpoint(uint8_t slave_id, uint16_t adc_val);
void can_send_setpoint_all(uint16_t adc_val);
void can_send_status_all(void);
void send_setpoint_to_target(uint8_t value);
void send_setpoint_to_slaves(void);
void send_setpoint_to_running_slaves(void);
void can_rx_callback(can_message_t *msg, uint8_t fmi);

// Slave management
void slave_info_init(slave_info_t *slave, uint8_t id);
void slave_update_connection(slave_info_t *slave);

// LCD display
void lcd_display_startup(void);
void lcd_update_display(void);
void lcd_display_mode_setpoint_uart(void);
void lcd_display_mode_setpoint_adc(void);

// Timer callback
void Timer4_IRQ_Callback(void);

// Interrupt handlers
void EXTI0_IRQHandler(void);
void EXTI1_IRQHandler(void);
void EXTI15_10_IRQHandler(void);

// =================== MAIN FUNCTION ===================
int main(void)
{
    system_init();
    Delay_ms(100);  // Wait for slaves to initialize
    can_send_status_all();
    lcd_display_startup();
    
    while (1)
    {
        // Process button flags
        if (SR & SR_BTN_MODE) {
            SR &= ~SR_BTN_MODE;  // Clear flag
            if (button_debounce(&button_mode)) {
                button_mode_handler();
            }
        }
        
        if (SR & SR_BTN_SLAVE1) {
            SR &= ~SR_BTN_SLAVE1;  // Clear flag
            if (button_debounce(&button_slave1)) {
                button_slave1_handler();
            }
        }
        
        if (SR & SR_BTN_SLAVE2) {
            SR &= ~SR_BTN_SLAVE2;  // Clear flag
            if (button_debounce(&button_slave2)) {
                button_slave2_handler();
            }
        }
        
        if (SR & SR_BTN_CONTROL) {
            SR &= ~SR_BTN_CONTROL;  // Clear flag
            if (button_debounce(&button_control)) {
                button_control_handler();
            }
        }
        
        // Process ADC update
        if (SR & SR_ADC_UPDATE) {
            SR &= ~SR_ADC_UPDATE;  // Clear flag
            adc_process();  // Always process ADC to update values
        }
        
        // Process setpoint update (every 100ms)
        if (SR & SR_SETPOINT_UPDATE) {
            SR &= ~SR_SETPOINT_UPDATE;  // Clear flag
            send_setpoint_to_running_slaves();
        }
        
        // Process status check
        if (SR & SR_STATUS_CHECK) {
            SR &= ~SR_STATUS_CHECK;  // Clear flag
            can_send_status_all();
        }
        
        // Process CAN RX
        if (SR & SR_CAN_RX) {
            SR &= ~SR_CAN_RX;  // Clear flag
            // Data already updated in can_rx_callback()
            // Can add additional processing here if needed
        }
        
        // Process LCD update
        if (SR & SR_LCD_UPDATE) {
            SR &= ~SR_LCD_UPDATE;  // Clear flag
            lcd_update_display();
        }
    }
}

