PlvLuin-243/STM32-Peripheral-Libraries/CAN_MASTER/main.c
// =================== SYSTEM INITIALIZATION ===================
void system_init(void)
{
    SysTick_Init();
    LCD_Init();
    Timer_IRQ_Init(TIM4, 71, 999);  // 1ms interrupt
    
    can_init();
    can_master_setup_filters(FB_SLAVE1, FB_SLAVE2);
    buttons_init();
    adc_gpio_init();
    DMA1_Channel1_Config();
    ADC1_DMA_Config();
    variables_init();
}

void adc_gpio_init(void)
{
    // Enable GPIOA clock
    RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    
    // PA1: ADC Channel 1 (Analog Input)
    GPIOA->CRL &= ~(0xF << (1*4));  // Analog mode (0000)
}

void adc_process(void)
{
    master_ctrl.adc_value = adc_value;
    master_ctrl.adc_setpoint = (uint8_t)((adc_value * PERCENTAGE_MAX) / ADC_MAX_VALUE);
    
    if (master_ctrl.adc_setpoint > PERCENTAGE_MAX)
        master_ctrl.adc_setpoint = PERCENTAGE_MAX;
}

void buttons_init(void)
{
    RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;
    
    button_init(&button_mode, BUTTON_MODE_PORT, BUTTON_MODE_PIN);
    button_init(&button_slave1, BUTTON_SLAVE1_PORT, BUTTON_SLAVE1_PIN);
    button_init(&button_slave2, BUTTON_SLAVE2_PORT, BUTTON_SLAVE2_PIN);
    button_init(&button_control, BUTTON_CONTROL_PORT, BUTTON_CONTROL_PIN);
    
    // EXTI0 for Control button
    AFIO->EXTICR[0] &= ~AFIO_EXTICR1_EXTI0;
    AFIO->EXTICR[0] |= AFIO_EXTICR1_EXTI0_PB;
    EXTI->IMR |= EXTI_IMR_MR0;
    EXTI->FTSR |= EXTI_FTSR_TR0;
    NVIC_EnableIRQ(EXTI0_IRQn);
    
    // EXTI1 for Slave2 button
    AFIO->EXTICR[0] &= ~AFIO_EXTICR1_EXTI1;
    AFIO->EXTICR[0] |= AFIO_EXTICR1_EXTI1_PB;
    EXTI->IMR |= EXTI_IMR_MR1;
    EXTI->FTSR |= EXTI_FTSR_TR1;
    NVIC_EnableIRQ(EXTI1_IRQn);
    
    // EXTI10 for Slave1 button
    AFIO->EXTICR[2] &= ~AFIO_EXTICR3_EXTI10;
    AFIO->EXTICR[2] |= AFIO_EXTICR3_EXTI10_PB;
    EXTI->IMR |= EXTI_IMR_MR10;
    EXTI->FTSR |= EXTI_FTSR_TR10;
    
    // EXTI11 for Mode button
    AFIO->EXTICR[2] &= ~AFIO_EXTICR3_EXTI11;
    AFIO->EXTICR[2] |= AFIO_EXTICR3_EXTI11_PB;
    EXTI->IMR |= EXTI_IMR_MR11;
    EXTI->FTSR |= EXTI_FTSR_TR11;
    
    NVIC_EnableIRQ(EXTI15_10_IRQn);
}

void variables_init(void)
{
    master_ctrl.current_mode = MODE_SETPOINT_UART;
    master_ctrl.control_target = CONTROL_TARGET_ALL;
    master_ctrl.uart_setpoint = 0;
    master_ctrl.adc_value = 0;
    master_ctrl.adc_setpoint = 0;
    
    slave_info_init(&slave1_info, 1);
    slave_info_init(&slave2_info, 2);
}

// =================== BUTTON HANDLING ===================
void button_init(button_t *btn, GPIO_TypeDef *port, uint16_t pin)
{
    btn->port = port;
    btn->pin = pin;
    gpio_init_input(port, pin, GPIO_INPUT_PULLUP);
}

uint8_t button_debounce(button_t *btn)
{
    if (gpio_read_pin(btn->port, btn->pin) == LOW)
    {
        Delay_ms(DEBOUNCE_DELAY_MS);
        if (gpio_read_pin(btn->port, btn->pin) == LOW)
        {
            return 1;
        }
    }
    return 0;
}

void button_process_all(void)
{
    // TODO: Implementation
}

void button_mode_handler(void)
{
    // Chuyển đổi mode giữa UART và ADC
    if (master_ctrl.current_mode == MODE_SETPOINT_UART) {
        master_ctrl.current_mode = MODE_SETPOINT_ADC;
    } else {
        master_ctrl.current_mode = MODE_SETPOINT_UART;
    }
    
    // Gửi setpoint ngay khi chuyển mode
    send_setpoint_to_slaves();
}

void button_slave1_handler(void)
{
    // Toggle START/STOP for SLAVE1
    if (slave1_info.status == STATUS_RUNNING) {
        // If running, send STOP command
        can_send_command(CMD_STOP_SLAVE1);
    } else {
        // If stopped or idle, send START command
        can_send_command(CMD_START_SLAVE1);
        Delay_ms(10);  // Small delay for START command processing
        // Send current ADC value after START
        uint16_t adc_val = (master_ctrl.current_mode == MODE_SETPOINT_ADC) ? 
                           master_ctrl.adc_value : ((master_ctrl.uart_setpoint * ADC_MAX_VALUE) / PERCENTAGE_MAX);
        can_send_setpoint(1, adc_val);
    }
}

void button_slave2_handler(void)
{
    // Toggle START/STOP for SLAVE2
    if (slave2_info.status == STATUS_RUNNING) {
        // If running, send STOP command
        can_send_command(CMD_STOP_SLAVE2);
    } else {
        // If stopped or idle, send START command
        can_send_command(CMD_START_SLAVE2);
        Delay_ms(10);  // Small delay for START command processing
        // Send current ADC value after START
        uint16_t adc_val = (master_ctrl.current_mode == MODE_SETPOINT_ADC) ? 
                           master_ctrl.adc_value : ((master_ctrl.uart_setpoint * ADC_MAX_VALUE) / PERCENTAGE_MAX);
        can_send_setpoint(2, adc_val);
    }
}

void button_control_handler(void)
{
    // Chuyển đổi control target: All(2) -> Slave2(1) -> Slave1(0) -> All(2)...
    master_ctrl.control_target = (master_ctrl.control_target + 2) % 3;
}

// =================== CAN COMMUNICATION ===================
void can_send_command(can_command_t cmd)
{
    can_message_t msg;
    msg.id = cmd;
    msg.rtr = false;
    msg.length = 0;  // Command only, no data
    
    can_transmit(&msg);
}

void can_send_setpoint(uint8_t slave_id, uint16_t adc_val)
{
    can_message_t msg;
    msg.rtr = false;
    msg.length = 2;  // 2 bytes for 16-bit value (RPM or VOLT)
    
    uint16_t value;
    
    if (slave_id == 1) {
        // SLAVE1: Convert ADC directly to RPM
        value = (uint16_t)((adc_val * MOTOR_MAX_RPM) / ADC_MAX_VALUE);
        msg.id = CMD_SETPOINT_SLAVE1;
    } else if (slave_id == 2) {
        // SLAVE2: Convert ADC directly to VOLT
        value = (uint16_t)((adc_val * BUCK_MAX_VOLT) / ADC_MAX_VALUE);
        msg.id = CMD_SETPOINT_SLAVE2;
    } else {
        return;  // Invalid slave_id
    }
    
    // Send value as MSB, LSB
    msg.data[0] = (uint8_t)(value >> 8);    // MSB
    msg.data[1] = (uint8_t)(value & 0xFF);  // LSB
    
    can_transmit(&msg);
}

void can_send_setpoint_all(uint16_t adc_val)
{
    can_message_t msg;
    msg.id = CMD_SETPOINT_ALL;
    msg.rtr = false;
    msg.length = 4;  // 4 bytes: 2 for RPM, 2 for VOLT
    
    // Calculate RPM value for SLAVE1 (first 2 bytes)
    uint16_t rpm_value = (uint16_t)((adc_val * MOTOR_MAX_RPM) / ADC_MAX_VALUE);
    msg.data[0] = (uint8_t)(rpm_value >> 8);    // RPM MSB
    msg.data[1] = (uint8_t)(rpm_value & 0xFF);  // RPM LSB
    
    // Calculate VOLT value for SLAVE2 (last 2 bytes)
    uint16_t volt_value = (uint16_t)((adc_val * BUCK_MAX_VOLT) / ADC_MAX_VALUE);
    msg.data[2] = (uint8_t)(volt_value >> 8);    // VOLT MSB
    msg.data[3] = (uint8_t)(volt_value & 0xFF);  // VOLT LSB
    
