PlvLuin-243/STM32-Peripheral-Libraries/CAN_MASTER/main.c
    can_transmit(&msg);
}

void send_setpoint_to_slaves(void)
{
    // Get current ADC value based on mode
    uint16_t adc_val = (master_ctrl.current_mode == MODE_SETPOINT_ADC) ? 
                       master_ctrl.adc_value : ((master_ctrl.uart_setpoint * ADC_MAX_VALUE) / PERCENTAGE_MAX);
    
    // Send setpoint based on current control target
    switch(master_ctrl.control_target) {
        case CONTROL_TARGET_SLAVE1:
            can_send_setpoint(1, adc_val);
            break;
            
        case CONTROL_TARGET_SLAVE2:
            can_send_setpoint(2, adc_val);
            break;
            
        case CONTROL_TARGET_ALL:
            can_send_setpoint_all(adc_val);
            break;
    }
}

void send_setpoint_to_running_slaves(void)
{
    // Get current ADC value based on mode
    uint16_t adc_val = (master_ctrl.current_mode == MODE_SETPOINT_ADC) ? 
                       master_ctrl.adc_value : ((master_ctrl.uart_setpoint * ADC_MAX_VALUE) / PERCENTAGE_MAX);
    
    switch(master_ctrl.control_target) {
        case CONTROL_TARGET_SLAVE1:
            if (slave1_info.status == STATUS_RUNNING) {
                can_send_setpoint(1, adc_val);
            }
            break;
            
        case CONTROL_TARGET_SLAVE2:
            if (slave2_info.status == STATUS_RUNNING) {
                can_send_setpoint(2, adc_val);
            }
            break;
            
        case CONTROL_TARGET_ALL:
            if (slave1_info.status == STATUS_RUNNING && slave2_info.status == STATUS_RUNNING) {
                can_send_setpoint_all(adc_val);
            } else {
                if (slave1_info.status == STATUS_RUNNING) {
                    can_send_setpoint(1, adc_val);
                }
                if (slave2_info.status == STATUS_RUNNING) {
                    can_send_setpoint(2, adc_val);
                }
            }
            break;
    }
}

void can_send_status_all(void)
{
    can_message_t msg;
    msg.id = CMD_STATUS_ALL;
    msg.rtr = true;  // Remote Transmission Request
    msg.length = 0;  // RTR frames have no data
    
    can_transmit(&msg);
}

void send_setpoint_to_target(uint8_t value)
{
    // TODO: Implementation
}

void can_rx_callback(can_message_t *msg, uint8_t fmi)
{
    // Use FMI (Filter Match Index) to identify which slave sent the message
    // FMI 0: FB_SLAVE1 (0x301)
    // FMI 1: FB_SLAVE2 (0x302)
    
    if (fmi == 0) {
        // Message from SLAVE1
        // Message format: [status, setpoint_MSB, setpoint_LSB, ...]
        if (msg->length >= 3) {
            slave1_info.status = msg->data[0];
            // Combine MSB and LSB to form 16-bit setpoint
            slave1_info.current_setpoint = (msg->data[1] << 8) | msg->data[2];
        }
    }
    else if (fmi == 1) {
        // Message from SLAVE2
        // Message format: [status, setpoint_MSB, setpoint_LSB, ...]
        if (msg->length >= 3) {
            slave2_info.status = msg->data[0];
            // Combine MSB and LSB to form 16-bit setpoint
            slave2_info.current_setpoint = (msg->data[1] << 8) | msg->data[2];
        }
    }
    
    // Set CAN RX flag for processing in main loop
    SR |= SR_CAN_RX;
}

// =================== SLAVE MANAGEMENT ===================
void slave_info_init(slave_info_t *slave, uint8_t id)
{
    slave->status = 0;
    slave->current_setpoint = 0;
}

void slave_update_connection(slave_info_t *slave)
{
    // TODO: Implementation
}

// =================== LCD DISPLAY ===================
void lcd_display_startup(void)
{
    // Hien thi man hinh khoi dong
    LCD_Clear();
    LCD_SetCursor(0, 3);
    LCD_PrintString("VI DIEU KHIEN");
    LCD_SetCursor(1, 6);
    LCD_PrintString("NANG CAO");
    LCD_SetCursor(2, 0);
    LCD_PrintString("Nhom: 2 - 21.33");
    LCD_SetCursor(3, 0);
	LCD_PrintString("PROJECT: CAN - BUSH");
    Delay_ms(2000);
	
    LCD_Clear();
    LCD_SetCursor(0, 0);
    LCD_PrintString("MOTOR:     BUCK:");
    LCD_SetCursor(1, 0);
    LCD_PrintString("RPM:       VOLT:");
    LCD_SetCursor(2, 0);
    LCD_PrintString("SP:        SP:");
    LCD_SetCursor(3, 0);
	LCD_PrintString("UART:      ADC:");
}

void lcd_update_display(void)
{
    char buffer[21];
    
    // Display slave status on line 1 (MOTOR and BUCK status)
    // MOTOR status (SLAVE1) - Line 1, column 7
    LCD_SetCursor(0, 6);
    if (slave1_info.status == 0x00) {
        snprintf(buffer, sizeof(buffer), " -- ");
    } else if (slave1_info.status == 0x01) {
        snprintf(buffer, sizeof(buffer), "RUN ");
    } else if (slave1_info.status == 0x02) {
        snprintf(buffer, sizeof(buffer), "STOP");
    } else if (slave1_info.status == 0xFF) {
        snprintf(buffer, sizeof(buffer), "ERR ");
    } else {
        snprintf(buffer, sizeof(buffer), "??? ");
    }
    LCD_PrintString(buffer);
    
    // BUCK status (SLAVE2) - Line 1, column 16
    LCD_SetCursor(0, 16);
    if (slave2_info.status == 0x00) {
        snprintf(buffer, sizeof(buffer), " -- ");
    } else if (slave2_info.status == 0x01) {
        snprintf(buffer, sizeof(buffer), "RUN ");
    } else if (slave2_info.status == 0x02) {
        snprintf(buffer, sizeof(buffer), "STOP");
    } else if (slave2_info.status == 0xFF) {
        snprintf(buffer, sizeof(buffer), "ERR ");
    } else {
        snprintf(buffer, sizeof(buffer), "??? ");
    }
    LCD_PrintString(buffer);
    
    // Display SLAVE1 current setpoint (RPM feedback) - Line 2, column 5
    LCD_SetCursor(1, 5);
    if (slave1_info.current_setpoint == 0 && slave1_info.status == 0x00) {
        snprintf(buffer, sizeof(buffer), "---");
    } else {
        // Display as RPM value (slave sends back actual value)
        snprintf(buffer, sizeof(buffer), "%4d", slave1_info.current_setpoint);
    }
    LCD_PrintString(buffer);
    
    // Display SLAVE2 current setpoint (VOLT feedback) - Line 2, column 16
    LCD_SetCursor(1, 16);
    if (slave2_info.current_setpoint == 0 && slave2_info.status == 0x00) {
        snprintf(buffer, sizeof(buffer), "---");
    } else {
        // Display as voltage (slave sends back value in 0.01V units, so divide by 100)
        uint16_t volt_int = slave2_info.current_setpoint / 100;
        uint16_t volt_dec = (slave2_info.current_setpoint / 10) % 10;
        snprintf(buffer, sizeof(buffer), "%2d.%01d", volt_int, volt_dec);
    }
    LCD_PrintString(buffer);
    
    // Always update UART % display with * indicator if in UART mode (Line 4, column 5-8)
    LCD_SetCursor(3, 5);
    if (master_ctrl.current_mode == MODE_SETPOINT_UART) {
        snprintf(buffer, sizeof(buffer), "%3d *", master_ctrl.uart_setpoint);
    } else {
        snprintf(buffer, sizeof(buffer), "%3d  ", master_ctrl.uart_setpoint);
    }
    LCD_PrintString(buffer);
    
    // Always update ADC % display with * indicator if in ADC mode (Line 4, column 15-19)
    LCD_SetCursor(3, 15);
    if (master_ctrl.current_mode == MODE_SETPOINT_ADC) {
        snprintf(buffer, sizeof(buffer), "%3d *", master_ctrl.adc_setpoint);
    } else {
        snprintf(buffer, sizeof(buffer), "%3d  ", master_ctrl.adc_setpoint);
    }
    LCD_PrintString(buffer);
    
    // Get current setpoint percentage
    uint8_t current_setpoint = (master_ctrl.current_mode == MODE_SETPOINT_ADC) ? 
                                master_ctrl.adc_setpoint : master_ctrl.uart_setpoint;
    
    // Calculate RPM for display: 0-100% -> 0-6200 RPM
    static uint16_t display_rpm = 0;
    
    // Update RPM Setpoint with * indicator only if SLAVE1 is being controlled
    LCD_SetCursor(2, 4);
    if (master_ctrl.control_target == CONTROL_TARGET_SLAVE1) {
        // Only SLAVE1 controlled - show * only for SLAVE1
        display_rpm = (uint16_t)((current_setpoint * MOTOR_MAX_RPM) / PERCENTAGE_MAX);
        snprintf(buffer, sizeof(buffer), "%4d *", display_rpm);
    } else if (master_ctrl.control_target == CONTROL_TARGET_ALL) {
        // Both slaves controlled - show * for both
        display_rpm = (uint16_t)((current_setpoint * MOTOR_MAX_RPM) / PERCENTAGE_MAX);
        snprintf(buffer, sizeof(buffer), "%4d *", display_rpm);
    } else {
        // SLAVE2 only controlled - no * for SLAVE1
        snprintf(buffer, sizeof(buffer), "%4d  ", display_rpm);
    }
    LCD_PrintString(buffer);
    
    // Calculate Volt for display: 0-100% -> 0-10.00V (stored as 0-1000)
    static uint16_t display_volt = 0;
    
    // Update Volt Setpoint with * indicator only if SLAVE2 is being controlled
    LCD_SetCursor(2, 14);
    if (master_ctrl.control_target == CONTROL_TARGET_SLAVE2) {
        // Only SLAVE2 controlled - show * only for SLAVE2
        display_volt = (uint16_t)((current_setpoint * BUCK_MAX_VOLT) / PERCENTAGE_MAX);
        uint16_t volt_int = display_volt / 100;  // Integer part
        uint16_t volt_dec = (display_volt / 10) % 10;  // Decimal part
        snprintf(buffer, sizeof(buffer), "%2d.%01d *", volt_int, volt_dec);
    } else if (master_ctrl.control_target == CONTROL_TARGET_ALL) {
        // Both slaves controlled - show * for both
        display_volt = (uint16_t)((current_setpoint * BUCK_MAX_VOLT) / PERCENTAGE_MAX);
        uint16_t volt_int = display_volt / 100;  // Integer part
        uint16_t volt_dec = (display_volt / 10) % 10;  // Decimal part
        snprintf(buffer, sizeof(buffer), "%2d.%01d *", volt_int, volt_dec);
    } else {
        // SLAVE1 only controlled - no * for SLAVE2
        uint16_t volt_int = display_volt / 100;  // Integer part
        uint16_t volt_dec = (display_volt / 10) % 10;  // Decimal part
        snprintf(buffer, sizeof(buffer), "%2d.%01d  ", volt_int, volt_dec);
    }
    LCD_PrintString(buffer);
}

void lcd_display_mode_setpoint_uart(void)
{
    // TODO: Implementation
}

