PlvLuin-243/STM32-Peripheral-Libraries/CAN_MASTER/main.c
void lcd_display_mode_setpoint_adc(void)
{
    // TODO: Implementation
}

// =================== TIMER CALLBACK ===================
void Timer4_IRQ_Callback(void)
{
    lcd_update_counter++;
    status_check_counter++;
    
    if (lcd_update_counter >= LCD_UPDATE_PERIOD_MS)
    {
        lcd_update_counter = 0;
        SR |= SR_TIMER_100MS;       // Set 100ms timer flag
        SR |= SR_LCD_UPDATE;        // Set LCD update flag
        SR |= SR_ADC_UPDATE;        // Set ADC update flag
        SR |= SR_SETPOINT_UPDATE;   // Set setpoint update flag
    }
    
    // Status check every 1 seconds (1000ms)
    if (status_check_counter >= 1000)
    {
        status_check_counter = 0;
        SR |= SR_STATUS_CHECK;  // Set status check flag
    }
}

// =================== INTERRUPT HANDLERS ===================
void EXTI0_IRQHandler(void)
{
    if (EXTI->PR & EXTI_PR_PR0)
    {
        EXTI->PR = EXTI_PR_PR0;      // Clear pending bit
        SR |= SR_BTN_CONTROL;        // Set button control flag in SR
    }
}

void EXTI1_IRQHandler(void)
{
    if (EXTI->PR & EXTI_PR_PR1)
    {
        EXTI->PR = EXTI_PR_PR1;     // Clear pending bit
        SR |= SR_BTN_SLAVE2;         // Set button slave2 flag in SR
    }
}

void EXTI15_10_IRQHandler(void)
{
    if (EXTI->PR & EXTI_PR_PR10)
    {
        EXTI->PR = EXTI_PR_PR10;    // Clear pending bit
        SR |= SR_BTN_SLAVE1;         // Set button slave1 flag in SR
    }
    
    if (EXTI->PR & EXTI_PR_PR11)
    {
        EXTI->PR = EXTI_PR_PR11;    // Clear pending bit
        SR |= SR_BTN_MODE;           // Set button mode flag in SR
    }
}